{
  "content": {
    "title": "রোজা-রমজান সংক্রান্ত কয়েকটি সাধারণ ভুল",
    "subtitle": "<i>জেনে নিন কিছু মাসআলা ও বর্জনীয় কাজ</i>",
    "image": "https://raw.githubusercontent.com/Megaminds-BD/muslims-day-data/master/notification/image/fikhus-siam.jpeg",
    "body": "পবিত্র রমজানের রোজাকে যখন ইসলামের অন্যতম ভিত্তিই বলে দেয়া হলো, তখন এর গুরুত্ব বর্ণনার আর বিশেষ কোনো প্রয়োজন থাকে না। হযরত রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম স্পষ্ট বলেছেন : ইসলামের ভিত্তি পাঁচটি বিষয়ের ওপর—১. ‘আল্লাহ ছাড়া কোনো মাবুদ নেই এবং হযরত মুহাম্মদ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম আল্লাহর রাসূল’ এ মর্মে সাক্ষ্য দেয়া, ২. যথাযথভাবে নামাজ আদায় করা, ৩. জাকাত আদায় করা, ৪. হজ করা এবং ৫. রমজান মাসের রোজা রাখা। [সহীহ বুখারী, হাদীস : ৮]\n\nএক বছরে রমজান বারবার আসে না। একবার চলে গেলে দীর্ঘ এগার মাস পর দেখা মেলে আবার রমজানের। এক দিন এমনকি এক মুহূর্তেরও যেখানে কোনো ভরসা নেই, সেখানে এই দীর্ঘ সময় অতিক্রম করে পরবর্তী রমজান পাওয়ার নিশ্চয়তা কোথায়? এজন্যে আমাদের প্রত্যেকেরই উচিত, রমজান মাসকে যথাযথ গুরুত্বের সঙ্গে বরণ করে নেয়া। রমজান মাসে এবং রোজা রাখতে গিয়ে আমরা অনেকেই জড়িয়ে পড়ি এমন কিছু ভুলভ্রান্তি নিয়েই আমরা এখানে আলোচনা করছি।\n<h2>১. মুখে উচ্চারণ করে নিয়তকে জরুরি মনে করা</h2>\nশুধু রোজা নয়, যে কোনো ইবাদতের জন্যেই নিয়ত করা জরুরি। সহীহ বুখারী শরীফের হাদীস : সকল কাজ নিয়তের মাধ্যমেই মূল্যায়িত হবে। [হাদীস : ১] তবে মুখে উচ্চারণ করে নিয়ত করা জরুরি নয়। নিয়ত হলো অন্তরের সংকল্প। অর্থাৎ এমন সংকল্প করা—আমি আগামীকালের রোজা রাখার নিয়ত করছি। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ও তাঁর সাহাবীগণ মুখে উচ্চারণ করে নামাজ-রোজার নিয়ত করেছেন বলে কোনো প্রমাণ নেই। তাই একে সুন্নত বলাও ঠিক নয়। তবে অন্তরের সংকল্পের পাশাপাশি মুখে উচ্চারণ করে নিয়ত করায় কোনো সমস্যাও নেই। অনেকে মনে করেন, আরবিতে নিয়ত না করলে রোজা যেন পরিপূর্ণ হয় না। তাই তারা আরবি রোজার নিয়ত মুখস্থ করেন। অথচ আরবিতে এভাবে নিয়তের সঙ্গে রোজা পূর্ণ হওয়ার কোনো সম্পর্ক নেই।\n<h2>২. সাহরি না করা</h2>\nআমরা তিন বেলা যেভাবে খাবার খাই, অনেকে সেহরিকে তেমনি এক বেলা খাবারের মতো মনে করে থাকেন। এজন্যে কেউ কেউ কখনো কখনো ইচ্ছাকৃত সেহরি না খেয়েই রোজা রাখেন। অথচ হাদীস শরীফের ভাষ্য হলো : তোমরা সেহরি খাও, এতে বরকত রয়েছে। [সহীহ বুখারী, হাদীস : ১৯২৩] তাই সেহরির সময় সেহরির নিয়তে সামান্য কিছু হলেও খাওয়া উচিত।\n<h2>৩. সাহরি করতে না পারলে রোজা না রাখা</h2>\nসেহরির সময় যদি ঘুম থেকে উঠতে না পারে, তাহলে কেউ কেউ রোজাই ছেড়ে দেয়। এটা হতে পারে তাদের মানসিক দুর্বলতা যে, সেহরি না খেয়ে রোজা রাখা যাবে না, আবার হতে পারে তাদের অজ্ঞতা যে, সেহরি না খেলে রোজা হয় না। মনে রাখতে হবে, সেহরি খাওয়াও একটি ইবাদত এবং বরকতের বিষয়। কিন্তু সেহরি না খেলেও রোজা হয়ে যায়। তাই শুধু সেহরি খেতে না পারার অজুহাতে রোজা না রাখা বৈধ হবে না।\n<h2>৪. সাহরি আগে করে ফেলা</h2>\nসেহরির জন্যে উত্তম সময় হলো শেষ রাত। রোজা ফরজ হওয়ার শুরুর দিকে রমজানের রাতে একবার ঘুমানোর পর ঘুম থেকে জেগে আর কিছু খাওয়ার অনুমতি ছিল না। কিন্তু পরবর্তীতে আল্লাহ তায়ালা এ বিধান পাল্টে দেন এ বলে : রাতের কৃষ্ণরেখা থেকে ভোরের শুভ্ররেখা প্রতিভাত হওয়া পর্যন্ত তোমরা পানাহার করো। [বাকারা, আয়াত : ১৮৭] অনেকে রাতে ঘুমানোর সময়ই সেহরির নিয়ত করে কিছু খেয়ে নেয়। তাদের মনে রাখা উচিত, শেষ রাতই হলো সেহরির জন্যে উত্তম সময়। হ্যাঁ, যদি দেরি করে ঘুমানোর কারণে শেষ রাতে ঘুম থেকে ওঠা কারও পক্ষে সম্ভব না হয় তাহলে তার কথা ভিন্ন।\n<h2>৫. সময়ের প্রতি লক্ষ না রাখা</h2>\nসেহরি শেষ সময়ে করার ফজিলত পাওয়ার জন্যে অনেকে এতটাই বিলম্বিত করেন, যে সুবহে সাদেক হয়ে যাওয়ার আশংকা হয়। কেউ কেউ মনে করেন, আজান পর্যন্ত সেহরি খাওয়া যায়। মনে রাখবেন, আজানের সঙ্গে সেহরির সময় শেষ হওয়ার কোনো সম্পর্ক নেই। আমাদের দেশে রমজান মাসে যেসব ক্যালেন্ডার কিংবা সেহরি-ইফতারের সময়সূচি ছাপানো ও প্রচারিত হয়, সেগুলোতে সাধারণত সেহরির শেষ সময় এবং ফজরের আজানের মাঝে ৫/৬ মিনিট সময় থাকে। এটা মূলত দুই দিক থেকেই সতর্কতা। সেহরিকে সতর্কতামূলক একটু আগে শেষ করা হয়েছে, আবার ফজরের আজানকেও সতর্কতামূলক একটু পিছিয়ে দেয়া হয়েছে। তাই যদি কেউ এ সময়সূচি অনুযায়ী আজান পর্যন্ত সেহরি খায় তাহলে তার রোজা হবে না।\n<h2>৬. সাহরি খেয়ে মুখে পান ইত্যাদি রেখে ঘুমিয়ে পড়া</h2>\nযারা নিয়মিত পান খান, তারা অসতর্কতাবশত অনেক সময় পান চিবাতে চিবাতে ঘুমিয়ে পড়েন আর এভাবেই সুবহে সাদেক হয়ে যায়। যদি এভাবে মুখে পান থাকা অবস্থায় সুবহে সাদেক হয়ে যায় তাহলে রোজা কাজা করতে হবে।\n<h2>৭. ইফতার বিলম্বিত করা</h2>\nসেহরির মতো ইফতারও একটি ইবাদত। হযরত রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন : মানুষ যতদিন দ্রুত ইফতার করবে ততদিন তারা কল্যাণের মধ্যে থাকবে। [সহীহ বুখারী, হাদীস : ১৯৫৭] ইফতারের সময় হলে দ্রুত ইফতার করা উচিত। কেউ তো ইফতার না করেই মাগরিবের নামাজ পড়ে নেন। তারা হয়তো ভাবেন, আল্লাহর সন্তুষ্টির জন্যে এত দীর্ঘ সময় না খেয়ে থাকতে পারলাম, আর কিছুক্ষণ পারব না! কিন্তু হাদীসের শিক্ষা এর চেয়ে সম্পূর্ণ ভিন্ন।\nইফতারের সঙ্গেও আজানের কোনো সম্পর্ক নেই। ইফতারের সময় হয়ে গেলে আজান না হলেও ইফতার করাতে কোনো সমস্যা নেই। তবে এজন্যে অবশ্যই নিজ নিজ ঘড়ির সময় নির্ভরযোগ্য কোনো ঘড়ির সঙ্গে মিলিয়ে নিতে হবে।\n<h2>৮. দোয়া না করা</h2>\nদোয়াকে বলা হয় ইবাদতের মগজ। বান্দা আল্লাহর কাছে যতবেশি দোয়া করে আল্লাহ সে বান্দার প্রতি ততবেশি খুশি হন। শেষ রাত ও ইফতারের পূর্ব মুহূর্ত—এ দুটি সময়ে দোয়া কবুল হয়। তাই সেহরির আগে বা পরে এবং ইফতারের পূর্বে অবশ্যই নিজের ইহকালীন ও পরকালীন সফলতার জন্যে দোয়া করুন। নিজের গোনাহের জন্যে আল্লাহ তায়ালার কাছে তওবা-ইস্তেগফার করুন। রহমত-মাগফেরাত আর নাজাতের এ মাসে কল্যাণ ও মুক্তির জন্যে দোয়া ও ইস্তেগফার দুটি বড় মাধ্যম। ইফতারের আয়োজনের পেছনে পড়ে যেন দোয়ার এ সুযোগ হাতছাড়া না হয়ে যায় সে বিষয়ে অবশ্যই সতর্কতা কাম্য।\n<h2>৯. অপবিত্র অবস্থায় যদি সুবহে সাদেক হয়ে যায়</h2>\nপবিত্রতা হাসিলে সচেষ্ট যারা আল্লাহ তাদের ভালোবাসেন। আল্লাহ তায়ালার ঘোষণা শুনুন—‘নিশ্চয় আল্লাহ তওবাকারীদের ভালোবাসেন এবং পবিত্রতা হাসিলকারীদের ভালোবাসেন।’ [বাকারা, আয়াত : ২২২] তাই যথাসম্ভব সর্বদাই পবিত্র থাকতে সচেষ্ট থাকা উচিত। ছোট-বড় সবরকম অপবিত্রতা থেকে মুক্ত থাকা নামাজের জন্যে জরুরি। কিন্তু সুবহে সাদেকের সময় যদি কেউ অপবিত্রও থাকেন তাহলেও এতে তার রোজার কোনো সমস্যা হবে না। হ্যাঁ, যদি এ অপবিত্রতা থেকে মুক্ত না হয়ে ফজরের সময় পার করে দেয়, তাহলে ফজরের নামাজ না পড়ার জন্যে কঠিন গোনাহ হবে।\n<h2>১০. প্রতি রাতে তারাবি না পড়া</h2>\nরমজান মাসের প্রতি রাতে নারী-পুরুষ সকলের জন্যে বিশ রাকাত তারাবির নামাজ পড়া সুন্নতে মুয়াক্কাদা। এ নামাজের প্রতি অনেকের উদাসীনতা চোখে পড়ে। দীর্ঘ সময় নামাজ পড়ার ভয়ে কিংবা ব্যস্ততার ঠুনকো অজুহাতে তারা তারাবি পড়ে না। অথচ ফজরের দুই রাকাত সুন্নত জোহরের আগে-পরের মোট ছয় রাকাত যেমন সুন্নতে মুয়াক্কাদা, তেমনি তারাবির নামাজও সুন্নতে মুয়াক্কাদা। রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন : যে ব্যক্তি রমজানের রাতে ঈমানের সঙ্গে ও সওয়াবের আশায় (অন্য কোনো আশায় নয়, অভক্তি ও অমনোযোগিতার সঙ্গে নয়) দাঁড়িয়ে দাঁড়িয়ে (তারাবির) নামাজ পড়ে, তার পেছনের সমস্ত (ছগিরা) গোনাহ মাফ করে দেওয়া হয়। [সহীহ বুখারী, হাদীস : ৩৭] এমনকি কেউ যদি রোজা রাখতে না পারে, সম্ভব হলে তাকেও তারাবির নামাজ পড়া উচিত।\n<h2>১১. তারাবির নামাজের ফাঁকে ফাঁকে বিশেষ দোয়া পড়া</h2>\nদুই রাকাত করে এই নামাজ পড়তে হয়। প্রতি চার রাকাতের পর পর কিছুক্ষণ বিশ্রাম নেয়া হয়। এ বিশ্রামের সময় ইচ্ছা করলে যে কোনো জিকির দোয়া তাসবিহ পড়া যেতে পারে। নির্দিষ্ট কোনো দোয়া নেই। আমাদের সমাজে ‘সুবহানা যিল মুলকি ওয়াল মালাকুতি ...’ দোয়াটি প্রচলিত। এটি হাদীসে বর্ণিত কোনো দোয়া নয়। বিশুদ্ধ উচ্চারণে কেউ পড়তে পারলে ভালো, তবে না পড়লেও কোনো সমস্যা নেই। আর ভুল উচ্চারণে কিংবা কষ্ট করে এ দোয়া পড়ার চেয়ে সহজ অন্য যে কোনোকিছু পড়া যেতে পারে। এমনকি কিছু না পড়ে কেউ চাইলে চুপচাপও বসে থাকতে পারেন।\n<h2>১২. রোজা রাখতে না পারলে</h2>\nঅসুস্থতা কিংবা অন্য কোনো গ্রহণযোগ্য ওজরের কারণে যদি কেউ রমজান মাসে রোজা রাখতে না পারে, এবং পরবর্তীতে সে সমস্যা কেটে যাওয়ার কারণে সে রোজা রাখতে সামর্থ্য হয়, তাহলে তাকে রোজা কাজা করতে হবে। এ অবস্থায় রোজা কাজা না করে ফিদয়া দিয়ে দেয়া যথেষ্ট নয়। হ্যাঁ, যদি কেউ এমন অসুস্থ হয়, যে অসুস্থতার কারণে সে রোজাও রাখতে পারছে না এবং এ রোগ থেকে তার সুস্থতার আশাও নেই, তাহলে ফিদয়া দিতে হবে। এবং ফিদয়া আদায়ের পরও যদি সে আশাতীত ভাবেই সুস্থ হয়ে যায় তাহলে আবার রোজাগুলো কাজা করতে হবে।\n<h2>১৩. কয়েকটি মাসয়ালা</h2>\n<ul>\n \t<li>রোজা রাখার পর যদি কেউ অনিচ্ছাকৃত বমি করে, তা যত বেশিই হোক না কেন, এতে রোজা ভাঙ্গবে না। অনেকে বমি করাকে রোজা ভাঙ্গার কারণ মনে করেন। এটা ঠিক নয়। হ্যাঁ, যদি কেউ ইচ্ছাকৃত মুখ ভরে বমি করে, অর্থাৎ এত বেশি পরিমাণে বমি করল যা সে মুখে আটকে রাখতে পারে নি, তাহলে তার রোজা ভেঙ্গে যাবে। আর ইচ্ছাকৃত বমিও যদি মুখ ভরে না হয়, তাহলে এ বমির কারণে রোজা ভাঙবে না।</li>\n \t<li>বমির মতোই আরেকটি বিষয় হলো শরীর থেকে রক্ত বের হওয়া। কেউ কেউ মনে করেন, শরীরের কোথাও থেকে যদি রক্ত বের হয় কিংবা বের হয়ে গড়িয়ে পড়ে, তাহলে রোজা ভেঙ্গে যাবে কিংবা মাকরুহ হবে। কেউ বলেন, রোজা হালকা হয়ে যাবে। আসলে বিষয়টি এমন নয়। কথা হলো, যদি ইচ্ছাকৃত শরীর থেকে এত অধিক পরিমাণ রক্ত বের করা হয় যাতে তার অজ্ঞান হয়ে পড়ার আশংকা রয়েছে তাহলে তা মাকরুহ হবে। কিন্তু অজ্ঞান হয়ে পড়ার আশংকা নেই এমন অল্প পরিমাণ রক্ত ইচ্ছাকৃত বের করলেও রোজার সমস্যা হবে না। আর যদি অনিচ্ছাকৃত রক্তপাত হয় তাহলে তো আর রোজা ভাঙ্গা বা মাকরুহ হওয়ার কোনো প্রশ্নই থাকছে না।</li>\n \t<li>ইনহেলার ও ইনসুলিন : হাপানির রোগীদের জন্যে ইনহেলার আর ডায়াবেটিস রোগীদের জন্যে ইনসুলিন দুটি জরুরি বিষয়। তবে এক্ষেত্রে কথা হলো, রোজা রেখে ইনসুলিন নিলে রোজার কোনো ক্ষতি হয় না, কিন্তু রোজা রাখা অবস্থায় ইনহেলার ব্যবহার করলে রোজা ভেঙ্গে যাবে।"
  },
  "reference": [
    {
      "text": "রোযা ও রমজান সংক্রান্ত কিছু ভুল ধারনা - মাওলানা শিব্বীর আহমদ",
      "link": "https://muslimsday.com/রোজা-সংক্রান্ত-ভুল-ধারনা"
    }
  ],
  "footer_button": {
    "hint": "আমরা মুসলিমস ডে অ্যাপের ব্লগ সাইট ডেভেলপ করেছি। নিয়মিত আমরা এই সাইটে কন্টেন্ট আপলোড করব ইনশাআল্লাহ।",
    "text": "মুসলিমস ডে ব্লগ সাইটে যান",
    "link": "https:// muslimsday.com"
  }
}