{
  "info_en": "<h3>About Muslims Day App</h3>\n<p>Alhamdulillah. Since 2015 we have been developing this App.</p>\n<p>From 2015 to 2020, the name of our App was <strong>App of Ramadan</strong>. After 5 years of development, this app has lots of features and functionalities. So we renamed it to <strong>Muslims Day</strong>. We are trying to include a complete guideline of a muslim.</p>\n<p>First 3 years of release, we showed Google Ad in our app. But most of the time the Ad content is against Islam. Because of the Haram content of Ad, we turned off the Ad showing system. So we don&rsquo;t have any regular income from this App to continue our development except <strong>your donation</strong>.</p>\n<p><a href=\"\\&quot;\\&quot;\\&quot;https://www.facebook.com/SabaSanabilFoundation\\&quot;\\&quot;\\&quot;\" target=\"\\&quot;\\&quot;\\&quot;_blank\\&quot;\\&quot;\\&quot;\">Sab'a Sanabil Foundation</a> financially helped us to develop iOS App. We are greatful to them.</p>\n<h3>About Us</h3>\n<p>We have been developing this app under the banner of <a href=\"https://megaminds.technology/\" target=\"_blank\">Megaminds Technologies</a>. Everyone involved in its management is a professional software engineer. Everyone is working as a software engineer in several private companies. Besides, we work for Muslim Day before and after office work and on holidays.</p>\n<p>The team lead of Muslim's Day Project studied at Madrasah. Other members of the team also keep in touch with the Islamic scholars and try to follow the Islam.</p>\n<p>Regarding the app, we try to take the advice and guidance of the scholars of Qawmi Madrasah of Hanafi Madhhab.</p>\n<h3>Our Aqeedah</h3>\n<p>We hold the aqeedah of Ahlus Sunnah wal Jamaat. We try to follow the Sunnah of the Prophet (peace be upon him), the Companions (peace be upon him) and the deeds and guidelines of the Tabye and Tabe-Tabye.</p>\n<p>We try to stay away from all shirk and bidat. Which is reflected in this app.</p>\n<h3>Our Madhab</h3>\n<p>We follow Hanafi in fiqh. As well as respecting other schools of thought. We don't think other schools of thought are wrong. We think the opinion of our madhhab is best. The other opinion is also good. If anyone disagrees with our fiqh, we do not hate him for it. We try to stay away from sectarian debates and separatism.</p>\n<p>Since most people in Bangladesh follow the Hanafi Madhab. So the default settings of the app and the Masalah are given according to Hanafi Fiqh. At the same time, we try to mention the opinions of other schools of thought. Due to the limitations of our knowledge, it may not be possible all the time.</p>\n<h3>Contact</h3>\n<p>Muslims Day is your app. We walk through this path with your cooperation. It is normal to admit mistakes while walking this path. Feel free to let us know about your opinion regarding the app. Your inspiration will help us to move forward.</p>\n<p>Join the <a href=\"https://www.facebook.com/groups/muslimsday\" target=\"_blank\">Muslims Day App Users Facebook group</a> to get in touch with us. You can follow the <a href=\"https://www.facebook.com/muslimsdayapp\" target=\"_blank\">Facebook page of Muslims Day app</a> by liking it. You can email at: <a href=\"mailto:help.muslims.day@gmail.com\" target=\"_blank\">help.muslims.day@gmail.com</a>.</p>\n<p>Our website: <a href=\"https://muslimsday.com/\" target=\"_blank\">MuslimsDay.Com</a></p>\n<p>You are requested to continue using the app. Please share this app with your friends and families. Keep us in your prayers.</p>",
  "info_bn": "<h3>অ্যাপ সম্পর্কে</h3>\n<p>আলহামদুলিল্লাহ। ২০১৫ সাল থেকে এই অ্যাপটিকে আমরা ডেভেলপ ও নিয়মিত এর মানোন্নয়ন করে আসছি।</p>\n<p>২০১৫ সালে আমরা প্রথম যখন এই অ্যাপটি গুগল প্লে স্টোরে পাবলিশ করি তখন থেকে ২০২০ সালের মার্চের মাঝামাঝি পর্যন্ত এর নাম ছিল <strong>App Of Ramadan</strong>. এই অ্যাপটির প্রথম ৫ বছরে নিয়মিত আপডেট হতে হতে এমন একটা পর্যায়ে এসেছে যখন এটিকে আর অ্যাপ অফ রামাদান বা রমজান মাসের অ্যাপ বলা যাবে না।</p>\n<p>অনেক ফিচার সমৃদ্ধ সারা বছর ব্যবহারের উপযোগি অ্যাপটির নাম আমরা পরিবর্তন করে রেখেছি <strong>Muslims Day</strong>. অর্থাৎ একজন মুসলিমের সকাল থেকে সন্ধ্যা পর্যন্ত দ্বীন ইসলামের বিষয়ে যা যা প্রয়োজন তার সব কিছুকেই আমরা এই অ্যাপে নিয়ে আসার চেষ্টা করে যাচ্ছি।</p>\n<p>প্রথম তিন বছর অ্যাপে আমরা গুগলের বিজ্ঞাপন দেখাতাম। এরপর আমাদের ইউজারদের পর্দা লঙ্ঘন হবার আশংকায় সেই বিজ্ঞাপন দেখানো বন্ধ করে দিই। ফলে এই অ্যাপ থেকে কোনো রকম অর্থ উপার্জনের পথ বন্ধ হয়ে যায়। এখন আমাদের ব্যয় নির্বাহের মূল উৎস আপনাদের পাঠানো ডোনেশন।</p>\n<p>আমাদের অ্যাপের iOS ভার্সন ডেভেলপের জন্য আর্থিক ভাবে সহযোগিতা করেছেন <a href=\"\\&quot;\\&quot;\\&quot;https://www.facebook.com/SabaSanabilFoundation/\\&quot;\\&quot;\\&quot;\" target=\"\\&quot;\\&quot;\\&quot;_blank\\&quot;\\&quot;\\&quot;\">সাব'আ সানাবিল ফাউন্ডেশন</a>। আমরা তাদের প্রতি কৃতজ্ঞ।</p>\n<h3>আমাদের পরিচয়</h3>\n<p>আমরা <a href=\"https://megaminds.technology/\" target=\"_blank\">মেগামাইন্ডস টেকনোলোজিসের</a> ব্যানারে উক্ত অ্যাপটি ডেভেলপ করে আসছি। এর পরিচালনার সাথে জড়িত সবাই পেশাগত দিক থেকে সফটওয়্যার ইঞ্জিনিয়ার। প্রত্যেকেই বেসরকারি প্রতিষ্ঠানে সফওয়্যার ইঞ্জিনিয়ার হিসাবে চাকুরি করছি। পাশাপাশি অফিসের কাজের আগে-পরে ও ছুটির দিনগুলোতে মুসলিমস ডে'র জন্য কাজ করে থাকি।</p>\n<p>মুসলিমস ডে প্রোজেক্টের টিম লিড মাদরাসা থেকে পড়াশোনা করেছেন। এছাড়াও টিমের অন্যান্যরা আলেমদের সংস্পর্শে থাকেন এবং দ্বীন পালনের চেষ্টা করেন।</p>\n<p>অ্যাপের বিষয়ে আমরা চেষ্টা করি হানাফী মাযহাবের কওমী মাদরাসার আলেমদের পরামর্শ ও দিক নির্দেশনা গ্রহন করতে।</p>\n<h3>আমাদের আক্বিদা</h3>\n<p>আমরা আহলুস সুন্নাহ ওয়াল জামায়াতের আক্বিদা পোষণ করি। আমরা চেষ্টা করি নবীজির (সা) সুন্নাহ, সাহাবীগণ (রাঃ) এবং তাবেয়ী-তাবে তাবেয়ীগণের (রহ) আমল ও শিক্ষা অনুসরণ করার।</p>\n<p>যাবতীয় শিরক ও বিদআত থেকে আমরা দূরে থাকার চেষ্টা করি। যার প্রতিফলন এই অ্যাপে হয়ে থাকে।</p>\n<h3>আমাদের ফিকহী মাযহাব</h3>\n<p>আমরা ফিকহে হানাফী অনুসরণ করি। পাশাপাশি অন্যান্য মাযহাবের প্রতিও শ্রদ্ধাশীল। অন্যান্য মাযহাব বা মতকে ভুল মনে করি না। আমরা মনে করি <strong>আমাদের মাযহাবের মতটি উত্তম। অপর মতটিও ভাল।</strong> ফিকহের বিষয়ে আমাদের মতের বিপরীত মতের হলে, তার প্রতি বিদ্বেষ পোষণ করি না। আমরা চেষ্টা করি মাযহাব সংক্রান্ত বিতর্ক ও বিচ্ছিন্নতা থেকে দূরে থাকতে।</p>\n<p>বাংলাদেশের বেশির ভাগ মানুষ যেহেতু হানাফী মাযহাব অনুসরণ করেন। তাই অ্যাপের ডিফল্ট সেটিংস এবং মাসআলাগুলো হানাফী ফিকহ অনুযায়ী দেয়া। পাশাপাশি আমরা চেষ্টা করি অন্যান্য মাযহাবের মতগুলোকেও উল্লেখ করার। আমাদের জ্ঞানের সীমাবদ্ধতার জন্য হয়ত অনেক সময় তা সম্ভব হয়ে ওঠে না।</p>\n<h3>যোগাযোগ</h3>\n<p>Muslims Day আপনার অ্যাপ। আপনাদের সকলের সহযোগিতায় আমাদের পথ চলা। এই পথ চলতে গিয়ে নানা ভুলত্রুটির স্বীকার হওয়াটা স্বাভাবিক। অ্যাপ সম্পর্কে আপনার ভাল লাগা, মন্দ লাগা বা যে কোনো পরামর্শ আমাদেরকে জানাতে পারেন। আপনার অনুপ্রেরণা আমাদেরকে সামনে এগিয়ে যেতে সহযোগিতা করবে।</p>\n<p>আমাদের সাথে যোগাযোগের জন্য জয়েন করুন <a href=\"https://www.facebook.com/groups/muslimsday\" target=\"_blank\">Muslims Day App Users ফেসবুক গ্রুপে</a>। লাইক দিয়ে ফলো করতে পারেন <a href=\"https://www.facebook.com/muslimsdayapp\" target=\"_blank\">Muslims Day অ্যাপের ফেসবুক পেজ</a>। ইমেইল করতে পারেন এই ঠিকানায়ঃ <a href=\"mailto:help.muslims.day@gmail.com\" target=\"_blank\">help.muslims.day@gmail.com</a>.</p>\n<p>আমাদের ওয়েবসাইটঃ <a href=\"https://muslimsday.com/\" target=\"_blank\">MuslimsDay.Com</a></p>\n<p>অ্যাপটি নিজে ব্যবহার করুন। আপনার পরিচিতদের সাথে শেয়ার করুন। আপনার দুআয় আমাদের রাখবেন।</p>",
  "version_code": 2,
  "version_name": "0.0.3"
}