{
  "info_en": "<p style=\"text-align: justify;\">Alhamdulillah. Since 2015 we have been developing this App.</p>\n<p style=\"text-align: justify;\">From 2015 to 2020, the name of our App was <strong>App of Ramadan</strong>. After 5 years of development, this app has lots of features and functionalities. So we renamed it to <strong>Muslims Day</strong>. We are trying to include a complete guideline of a muslim.</p>\n<p style=\"text-align: justify;\">First 3 years of release, we showed Google Ad in our app. But most of the time the Ad content is against Islam. Because of the Haram content of Ad, we turned off the Ad showing system. So we don&rsquo;t have any regular income from this App to continue our development except <strong>your donation</strong>.</p>\n<p style=\"text-align: justify;\">Till now we are trying to give our money, time and effort for development of this application. If every user can send only 100 TK donations every month, it will be a huge help to continue the development. We can give some honorarium to our engineers who work very hard and spend a lot of time here.</p>\n<p style=\"text-align: justify;\">You are requested to continue using the app. Please share this app with your friends and families.</p>\n<p style=\"text-align: justify;\">Keep us in your prayers.</p>",
  "info_bn": "<p style=\"text-align: justify;\">আলহামদুলিল্লাহ। ২০১৫ সাল থেকে এই অ্যাপটিকে আমরা ডেভেলপ ও নিয়মিত এর মানোন্নয়ন করে আসছি।</p>\n<p style=\"text-align: justify;\">২০১৫ সালে আমরা প্রথম যখন এই অ্যাপটি গুগল প্লে স্টোরে পাবলিশ করি তখন থেকে ২০২০ সালের মার্চের মাঝামাঝি পর্যন্ত এর নাম ছিল <strong>App Of Ramadan</strong>. এই অ্যাপটির প্রথম ৫ বছরে নিয়মিত আপডেট হতে হতে এমন একটা পর্যায়ে এসেছে যখন এটিকে আর অ্যাপ অফ রামাদান বা রমজান মাসের অ্যাপ বলা যাবে না।</p>\n<p style=\"text-align: justify;\">অনেক ফিচার সমৃদ্ধ সারা বছর ব্যবহারের উপযোগি অ্যাপটির নাম আমরা পরিবর্তন করে রেখেছি <strong>Muslims Day</strong>. অর্থাৎ একজন মুসলিমের সকাল থেকে সন্ধ্যা পর্যন্ত দ্বীন ইসলামের বিষয়ে যা যা প্রয়োজন তার সব কিছুকেই আমরা এই অ্যাপে নিয়ে আসার চেষ্টা করে যাচ্ছি।</p>\n<p style=\"text-align: justify;\">প্রথম তিন বছর অ্যাপে আমরা গুগলের বিজ্ঞাপন দেখাতাম। এরপর আমাদের ইউজারদের পর্দা লঙ্ঘন হবার আশংকায় সেই বিজ্ঞাপন দেখানো বন্ধ করে দিই। ফলে এই অ্যাপ থেকে কোনো রকম অর্থ উপার্জনের পথ বন্ধ হয়ে যায়।</p>\n<p style=\"text-align: justify;\">আমরা আল্লাহর উপর তাওয়াক্কুল করে এখন পর্যন্ত নিজেদের অর্থ, সময় ও শ্রম ব্যয় করে এই অ্যাপের নিয়মিত ডেভেলপমেন্ট চালিয়ে যাচ্ছি। আমাদের সকল ইউজার যদি মাসে অন্তত ১০০ টাকা করেও আমাদেরকে <strong>অনুদান</strong> পাঠান। তাহলে আমরা আমাদের ইঞ্জিনিয়ারদেরকে উপযুক্ত সম্মানী দিতে পারব ইনশাআল্লাহ।</p>\n<p style=\"text-align: justify;\">অ্যাপটি নিজে ব্যবহার করুন। আপনার পরিচিতদের সাথে শেয়ার করুন।</p>\n<p style=\"text-align: justify;\">আপনার দুআয় আমাদের রাখবেন।</p>",
  "version_code": 80,
  "version_name": "0.0.1",
  "change_log": [
    {
      "timestamp": 1647395197,
      "version_name": "0.0.1",
      "change_en": "This is very first release of iOS App with very basic functionalities. 1st MVP (Minimal viable product) release on App Store.",
      "change_bn": "অ্যাপ স্টোরে এটা আমাদের প্রথম MVP (Minimal viable product) রিলিজ। ব্যাসিক কিছু ফিচার সহ এটি রিলিজ হয়েছে।"
    }
  ]
}