{
  "isEnable": true,
  "info": {
    "message_en": "<h2>Donate for Muslims Day App development</h2>\n<p>To build a house you have to buy space, bricks and sand etc. You have to pay engineers and labor costs. The same thing goes for App development. We have to pay Engineers on a regular basis. The house needs to be repaired more or less every month. In the same way, software engineers have to work for the app every day.<br /><br />That's why we need your financial support for this project.</p>\n<h3>Why do we ask for donations?</h3>\n<p>The main way to earn money from the app in Bangladesh is to show Google ads on the app. There is no income when users download or use the app. If we show Google Ad, then we can get money from Google. But many advertisements show haraam products or obscene content. This violates the rule of Islam. So we have closed this way of earning.<br /><br />But how are the engineers' payments made? Through the donations you send!<br /><br />If you have benefited from this app. If you want to keep this app running in the future. Then you can donate here as much as you can. If you donate monthly at least 100 TK, it will also take the project a long way. InshaAllah, it will be considered as sadakaye zaria for you.<br /><br /><strong><em>Note: Zakat, Fitra, Mannat, money for the skin of the sacrificial animal cannot be given here. Even if someone gives it, it will not be acceptable. It is a simple sadaqa, which can be given as a gift.</em></strong></p>\n<h2>bKash Marchant Account<br /><a title=\"Donate for Muslims Day\" href=\"https://shop.bkash.com/muslims-day01724014785/paymentlink\" target=\"_blank\">01724014785 (tap here)</a></h2>\n<p>(Make Payment without bKash charge)</p>\n<h4>bKash, Nagad, Rocket (Personal number)</h4>\n<h2>01521101145</h2>\n<p>(Use SEND MONEY option. PLEASE DO NOT CALL.)</p>\n<h3>Bank Account</h3>\n<p>Account Name: Abdullah Al Hasan<br />A/C number: 20502100204303506<br />District: Dhaka North<br />Branch: Mirpur Section 1<br />Account Type: MSA (Savings account)<br />Bank Name: Islami Bank Bangladesh Limited</p>",
    "message_bn": "<h2>আপনাদের এই অ্যাপের ডেভেলপমেন্টের জন্য অনুদান দিন</h2>\n<p>একটা বাড়ি বানাতে যেমন জায়গা কিনতে হয়, ইট-বালু কিনতে হয়, ইঞ্জিনিয়ার আর লেবার খরচ দিতে হয়। সেরকম একটা অ্যাপের জন্যও ইঞ্জিনিয়ারদেরকে অনেক টাকা পেমেন্ট করতে হয়। প্রতি মাসেই কম বেশি বাড়ির মেরামত করার দরকার হয়। একই ভাবে অ্যাপের জন্যও নিয়মিত সফটওয়্যার ইঞ্জিনিয়ারদের কাজ করতে হয়।</p>\n<p>তাই অ্যাপের নিয়মিত আপডেটের জন্য আপনার ডেনেশন প্রয়োজন।</p>\n<h3>আমরা কেন ডোনেশন চাই?</h3>\n<p>বাংলাদেশে অ্যাপ থেকে অর্থ উপার্জনের প্রধান উপায় হচ্ছে অ্যাপে গুগলের বিজ্ঞাপন দেখানো। ইউজাররা অ্যাপ ডাউনলোড করলে বা ইউজ করলে কোনো ইনকাম হয় না। গুগলের Ad দেখালে সেখান থেকে টাকা পাওয়া যায়। কিন্তু অনেক বিজ্ঞাপনেই হারাম পণ্য বা অশালীন কনটেন্ট দেখানো হয়ে থাকে। এতে ইউজারদের চোখের পর্দার বিধান লঙ্ঘন হয়। তাই আমরা উপার্জনের এই পথটি বন্ধ করে দিয়েছি।</p>\n<p>তাহলে ইঞ্জিনিয়ারদের পেমেন্টগুলো কিভাবে করা হয়? আপনাদের পাঠানো ডোনেশনের মাধ্যমে।</p>\n<p>আপনি যদি এই অ্যাপের মাধ্যমে উপকৃত হয়ে থাকেন। যদি আগামীতেও এই অ্যাপটিকে চলমান রাখতে চান। তাহলে আপনার সাধ্য মত এখানে ডোনেট করতে পারেন। প্রতি মাসে অন্তত ১০০ টাকা অনুদানও ইনশাআল্লাহ প্রজেক্টটিকে অনেক দূর এগিয়ে নিবে। যা সাদকায়ে জারিয়া হিসাবে আপনার আমলনামায় যোগ হবে।</p>\n<p><strong><em>বিঃ দ্রঃ যাকাত, ফিতরা, মান্নত, কুরবানীর পশুর চামড়ার টাকা এখানে দেয়া যাবে না। দিলেও আদায় হবে না। এটি সাধারণ সাদাকা, যা হাদিয়া বা গিফট হিসাবে দেয়া যাবে।</em></strong></p>\n<h2>বিকাশ মার্চেন্ট অ্যাকাউন্ট<br /><a title=\"Donate for Muslims Day\" href=\"https://shop.bkash.com/muslims-day01724014785/paymentlink\" target=\"_blank\">01724014785 (ক্লিক করুন)</a></h2>\n<p>(উপরের নাম্বার পেমেন্ট করুন। বিকাশের চার্জ কাটবে না)</p>\n<h3><strong>বিকাশ, নগদ ও রকেট (পারসোনাল নাম্বার)</strong></h3>\n<h2>01521101145</h2>\n<p>(সেন্ড মানি করুন)</p>\n<h3>ব্যাংক অ্যাকাউন্ট</h3>\n<p>Account Name: Abdullah Al Hasan<br />A/C number: 20502100204303506<br />District: Dhaka North<br />Branch: Mirpur Section 1<br />Account Type: MSA (Savings account)<br />Bank Name: Islami Bank Bangladesh Limited</p>"
  }
}
