[
  {
    "title_en": "ফজরের ওয়াক্ত নির্ধারণ পদ্ধতি",
    "title_bn": "ফজরের ওয়াক্ত নির্ধারণ পদ্ধতি",
    "subtitle_en": "ফজরের ওয়াক্ত হচ্ছে সুবহে সাদিক থেকে সূর্যোদয়ের আগ পর্যন্ত",
    "subtitle_bn": "ফজরের ওয়াক্ত হচ্ছে সুবহে সাদিক থেকে সূর্যোদয়ের আগ পর্যন্ত",
    "body_en": "ইমামদের মাঝে ফজরের ওয়াক্ত শুরু ও শেষের ব্যাপারে কোনো মতপার্থক্য নাই। সুবহে সাদিকের সময় ফজরের ওয়াক্ত শুরু হয় এবং সূর্য ওঠা শুরু হওয়ার আগ পর্যন্ত এই ওয়াক্ত থাকে।\n\nসূর্য যখন ভূপৃষ্ঠ থেকে ১৮ ডিগ্রি নিচে অবস্থান করে তখন সুবহে সাদিক শুরু হয়। বাংলাদেশ, ভারত, পাকিস্তান, আফগানিস্তান, আমেরিকা ও ইউরোপের কিছু অংশে ১৮ ডিগ্রিতে সুবহে সাদিক হয়। অন্যান্য দেশের ক্ষেত্রে এই পরিমাণ ভিন্ন ভিন্ন হয়ে থাকে। আপনি যখন দেশ সিলেক্ট করেন তখন অটোমেটিক ভাবে এই ডিগ্রির মান সিলেক্ট হয়ে যাবে। যা আপনি সেটিংস থেকে “নামাজের সময় হিসাব করার পদ্ধতি” অপশনে দেখতে পাবেন।\n\nফজরের ওয়াক্ত শেষ হয় সূর্য ওঠা শুরু হলে। আপনি সেটিংস থেকে যেই দেশ সিলেক্ট করবেন বা GPS অপশন সিলেক্ট করলে ঐ স্থানের জন্য সূর্যদয়ের সময় অ্যাপের মধ্যেই ক্যালকুলেট করা হয়েছে। নিশ্চিত হবার জন্য আমাদের অ্যাপে দেখানো সূর্যোদয়ের সময়ের সাথে গুগলে সার্চ করে বা কোনো নির্ভরযোগ্য ওয়েবসাইট যেমনঃ timeanddate.com এর সাথে মিলিয়ে নিতে পারেন। তবে অনুরোধ থাকবে আপনার এলাকার মসজিদে বা ইসলামিক ফাউন্ডেশন থেকে চিরস্থায়ী ক্যালেন্ডারের সাথে এ সময় না মিললে আমাদেরকে গালাগালি করবেন না। এমন হতে পারে তাদের ক্যালেন্ডারটা অনেক আগের। তখনকার ডেটা দিয়ে সেটা বানানো হয়েছে। অথবা তারা সময়গুলো accurate না রেখে কয়েক মিনিট সতর্কতার জন্য যোগ বিয়োগ করেছে।",
    "body_bn": "ইমামদের মাঝে ফজরের ওয়াক্ত শুরু ও শেষের ব্যাপারে কোনো মতপার্থক্য নাই। সুবহে সাদিকের সময় ফজরের ওয়াক্ত শুরু হয় এবং সূর্য ওঠা শুরু হওয়ার আগ পর্যন্ত এই ওয়াক্ত থাকে।\n\nসূর্য যখন ভূপৃষ্ঠ থেকে ১৮ ডিগ্রি নিচে অবস্থান করে তখন সুবহে সাদিক শুরু হয়। বাংলাদেশ, ভারত, পাকিস্তান, আফগানিস্তান, আমেরিকা ও ইউরোপের কিছু অংশে ১৮ ডিগ্রিতে সুবহে সাদিক হয়। অন্যান্য দেশের ক্ষেত্রে এই পরিমাণ ভিন্ন ভিন্ন হয়ে থাকে। আপনি যখন দেশ সিলেক্ট করেন তখন অটোমেটিক ভাবে এই ডিগ্রির মান সিলেক্ট হয়ে যাবে। যা আপনি সেটিংস থেকে “নামাজের সময় হিসাব করার পদ্ধতি” অপশনে দেখতে পাবেন।\n\nফজরের ওয়াক্ত শেষ হয় সূর্য ওঠা শুরু হলে। আপনি সেটিংস থেকে যেই দেশ সিলেক্ট করবেন বা GPS অপশন সিলেক্ট করলে ঐ স্থানের জন্য সূর্যদয়ের সময় অ্যাপের মধ্যেই ক্যালকুলেট করা হয়েছে। নিশ্চিত হবার জন্য আমাদের অ্যাপে দেখানো সূর্যোদয়ের সময়ের সাথে গুগলে সার্চ করে বা কোনো নির্ভরযোগ্য ওয়েবসাইট যেমনঃ timeanddate.com এর সাথে মিলিয়ে নিতে পারেন। তবে অনুরোধ থাকবে আপনার এলাকার মসজিদে বা ইসলামিক ফাউন্ডেশন থেকে চিরস্থায়ী ক্যালেন্ডারের সাথে এ সময় না মিললে আমাদেরকে গালাগালি করবেন না। এমন হতে পারে তাদের ক্যালেন্ডারটা অনেক আগের। তখনকার ডেটা দিয়ে সেটা বানানো হয়েছে। অথবা তারা সময়গুলো accurate না রেখে কয়েক মিনিট সতর্কতার জন্য যোগ বিয়োগ করেছে।"
  },
  {

    "title_en": "যুহরের ওয়াক্ত নির্ধারণ পদ্ধতি",
    "title_bn": "যুহরের ওয়াক্ত নির্ধারণ পদ্ধতি",
    "subtitle_en": "সূর্য মধ্য আকাশ থেকে পশ্চিমে হেলে পড়া থেকে আসরের আগ পর্যন্ত",
    "subtitle_bn": "সূর্য মধ্য আকাশ থেকে পশ্চিমে হেলে পড়া থেকে আসরের আগ পর্যন্ত",
    "body_en": "সূর্য যখন মধ্য আকাশ থেকে পশ্চিম দিকে হেলে পড়ে তখন থেকে যুহরের ওয়াক্ত শুরু হয়। এ নিয়ে ইমামদের মধ্যে কোনো মতপার্থক্য নাই। কিন্তু যুহরের ওয়াক্ত কখন শেষ হবে তা নিয়ে হাদীসের দুইটা মত প্রসিদ্ধ।\n\nপ্রথমত কোনো বস্তুর ছায়া যখন ঐ বস্তুর সমান হবে ততক্ষণ পর্যন্ত যুহরের ওয়াক্ত থাকে। আর দ্বিতীয় মতটি হচ্ছে কোনো বস্তুর ছায়া যখন ঐ বস্তুর দ্বিগুণ হয় ততক্ষণ পর্যন্ত যুহরের ওয়াক্ত বাকি থাকে।\n\nইমাম আবু হানীফা (রহ.) দ্বিতীয় মতের উপর আমল করতেন। তিনি দ্বিতীয় মতের উপর ভিত্তি করে ফতোয়া দিয়েছেন যুহরের ওয়াক্ত শেষ হওয়ার ব্যাপারে। অপর দিকে প্রথম মতের উপর আমল করেন ও ফতোয়া প্রদান করেছেন ইমাম শাফেয়ী (রহ.), ইমাম মালেক (রহ.), ইমাম আহমাদ ইবনে হাম্বল (রহ.) এবং ইমাম আবু হানীফার (রহ.) দুইজন প্রসিদ্ধ ছাত্র ইমাম ইউসুফ (রহ.) ও ইমাম মুহাম্মাদ (রহ.)। অর্থাৎ ইমাম আবু হানীফা (রহ.) ছাড়া অন্যান্য ইমামগণ যুহরের শেষ ওয়াক্ত নিয়ে একমত।\n\nযেহেতু যুহরের ওয়াক্ত কখন শেষ হবে তা নিয়ে দুই ধরনের আমল ও দলীল পাওয়া যায় তাই আমরা আমাদের অ্যাপের সেটিংসে মাজহাব সিলেক্ট করার অপশন রেখেছি। অ্যাপ ইন্সটল করার পর অটোমেটিক ভাবে হানাফী মাজহাব সিলেক্ট হয়ে থাকবে। যেহেতু আমাদের দেশের বেশির ভাগ মানুষই হানাফী মাজহাবের ফতোয়া অনুসরণ করেন। কিন্তু যারা অন্য ইমামের মত অনুসরণ করেন, তাদেরকে সেটিংস থেকে একবারের জন্য মাজহাব সেট করে নিতে হবে।\n\nমধ্য আকাশ থেকে সূর্য 0.1 ডিগ্রি পশ্চিমে ঢলে পড়লেই আমাদের অ্যাপে যুহরের ওয়াক্ত শুরু হয়ে যাবে। এটা অ্যাপ ও ওয়েবসাইট ভেদে ২-১ মিনিট ভিন্ন হতে পারে। আমরা যেমন 0.1 ডিগ্রি সরে গেলে যুহরের ওয়াক্ত হিসাব করছি, কোনো কোনো অ্যাপ হয়ত 0.5 ডিগ্রি সরে গেলে যুহরের ওয়াক্ত শুরু করছে। কোন ওয়াক্তে কত ডিগ্রি সরবে এমন absolute কোনো মান নির্ধারণ করা নাই। কারণ রাসূলের (সা) যুগে সূর্যের অবস্থানের এই ডিগ্রির হিসাব ছিল না। তাই আপনি যেই অ্যাপ দেখেই নামাজের সময় নির্ধারণ করেন না কেন ইনশাআল্লাহ আপনার নামাজ আদায় হয়ে যাবে। আল্লাহ আপনার নিয়ত জানেন। আর প্রতিটা অ্যাপেই সাধারণত ঠিকঠাক হিসাবই দেয়া থাকে। ২-১ মিনিট এদিক ওদিক হতে পারে। সবগুলোকেই আমরা বলব সঠিক।\nযুহরের ওয়াক্ত শেষেের জন্য, কখন কোনো বস্তুর ছায়া এক গুণ হয় আর কখন দ্বিগুণ হয় তা ক্যালকুলেট করার ফর্মুলা রয়েছে। আমরা সেই ফর্মুলা ব্যবহার করে এই সময় অ্যাপে প্রদর্শন করে থাকি।",
    "body_bn": "সূর্য যখন মধ্য আকাশ থেকে পশ্চিম দিকে হেলে পড়ে তখন থেকে যুহরের ওয়াক্ত শুরু হয়। এ নিয়ে ইমামদের মধ্যে কোনো মতপার্থক্য নাই। কিন্তু যুহরের ওয়াক্ত কখন শেষ হবে তা নিয়ে হাদীসের দুইটা মত প্রসিদ্ধ।\n\nপ্রথমত কোনো বস্তুর ছায়া যখন ঐ বস্তুর সমান হবে ততক্ষণ পর্যন্ত যুহরের ওয়াক্ত থাকে। আর দ্বিতীয় মতটি হচ্ছে কোনো বস্তুর ছায়া যখন ঐ বস্তুর দ্বিগুণ হয় ততক্ষণ পর্যন্ত যুহরের ওয়াক্ত বাকি থাকে।\n\nইমাম আবু হানীফা (রহ.) দ্বিতীয় মতের উপর আমল করতেন। তিনি দ্বিতীয় মতের উপর ভিত্তি করে ফতোয়া দিয়েছেন যুহরের ওয়াক্ত শেষ হওয়ার ব্যাপারে। অপর দিকে প্রথম মতের উপর আমল করেন ও ফতোয়া প্রদান করেছেন ইমাম শাফেয়ী (রহ.), ইমাম মালেক (রহ.), ইমাম আহমাদ ইবনে হাম্বল (রহ.) এবং ইমাম আবু হানীফার (রহ.) দুইজন প্রসিদ্ধ ছাত্র ইমাম ইউসুফ (রহ.) ও ইমাম মুহাম্মাদ (রহ.)। অর্থাৎ ইমাম আবু হানীফা (রহ.) ছাড়া অন্যান্য ইমামগণ যুহরের শেষ ওয়াক্ত নিয়ে একমত।\n\nযেহেতু যুহরের ওয়াক্ত কখন শেষ হবে তা নিয়ে দুই ধরনের আমল ও দলীল পাওয়া যায় তাই আমরা আমাদের অ্যাপের সেটিংসে মাজহাব সিলেক্ট করার অপশন রেখেছি। অ্যাপ ইন্সটল করার পর অটোমেটিক ভাবে হানাফী মাজহাব সিলেক্ট হয়ে থাকবে। যেহেতু আমাদের দেশের বেশির ভাগ মানুষই হানাফী মাজহাবের ফতোয়া অনুসরণ করেন। কিন্তু যারা অন্য ইমামের মত অনুসরণ করেন, তাদেরকে সেটিংস থেকে একবারের জন্য মাজহাব সেট করে নিতে হবে।\n\nমধ্য আকাশ থেকে সূর্য 0.1 ডিগ্রি পশ্চিমে ঢলে পড়লেই আমাদের অ্যাপে যুহরের ওয়াক্ত শুরু হয়ে যাবে। এটা অ্যাপ ও ওয়েবসাইট ভেদে ২-১ মিনিট ভিন্ন হতে পারে। আমরা যেমন 0.1 ডিগ্রি সরে গেলে যুহরের ওয়াক্ত হিসাব করছি, কোনো কোনো অ্যাপ হয়ত 0.5 ডিগ্রি সরে গেলে যুহরের ওয়াক্ত শুরু করছে। কোন ওয়াক্তে কত ডিগ্রি সরবে এমন absolute কোনো মান নির্ধারণ করা নাই। কারণ রাসূলের (সা) যুগে সূর্যের অবস্থানের এই ডিগ্রির হিসাব ছিল না। তাই আপনি যেই অ্যাপ দেখেই নামাজের সময় নির্ধারণ করেন না কেন ইনশাআল্লাহ আপনার নামাজ আদায় হয়ে যাবে। আল্লাহ আপনার নিয়ত জানেন। আর প্রতিটা অ্যাপেই সাধারণত ঠিকঠাক হিসাবই দেয়া থাকে। ২-১ মিনিট এদিক ওদিক হতে পারে। সবগুলোকেই আমরা বলব সঠিক।\nযুহরের ওয়াক্ত শেষেের জন্য, কখন কোনো বস্তুর ছায়া এক গুণ হয় আর কখন দ্বিগুণ হয় তা ক্যালকুলেট করার ফর্মুলা রয়েছে। আমরা সেই ফর্মুলা ব্যবহার করে এই সময় অ্যাপে প্রদর্শন করে থাকি।"
  },
  {
    "title_en": "আসরের ওয়াক্ত নির্ধারণ পদ্ধতি",
    "title_bn": "আসরের ওয়াক্ত নির্ধারণ পদ্ধতি",
    "subtitle_en": "যুহরের ওয়াক্ত শেষ হওয়া থেকে সূর্যাস্তের আগ পর্যন্ত",
    "subtitle_bn": "যুহরের ওয়াক্ত শেষ হওয়া থেকে সূর্যাস্তের আগ পর্যন্ত",
    "body_en": "আসরের ওয়াক্ত শুরু হয় যুহরের ওয়াক্ত শেষ হওয়ার সাথে সাথে। আর ওয়াক্ত শেষ হয় সূর্য ডুবতে শুরু করলে। এটা নিয়ে ইমামদের মাঝে মতপার্থক্য নাই।\n\nকিন্তু মতপার্থক্য আছে যুহরের শেষ সময় কখন তা নিয়ে। যে ব্যাপারে যুহরের ওয়াক্ত নির্ধারণ পদ্ধতিতে বিস্তারিত বলা হয়েছে। তাই আর এখানে সেই আলোচনার পুনরাবৃত্তি করলাম না।\n\nসেটিংস থেকে মাজহাব সেট করে নিলে ঐ মাজহাবের ফতোয়ার সময় অনুযায়ী আসরের শুরুর ওয়াক্ত সেট হবে। আর আসরের ওয়াক্ত শেষ হওয়ার সময় বের করা হয়েছে সূর্যাস্তের সময় থেকে ১ মিনিট বিয়োগ করে।\n\nপ্রসঙ্গত উল্লেখ্য, সূর্য যখন ডুবতে থাকে ঐ সময়ে নামাজ পড়া হারাম। কিন্তু অ্যাপে সূর্য ডোবার নিষিদ্ধ সময়টাকেও আসরের সময় হিসাবে দেখানো হয়েছে। এক্ষেত্রে মাসআলা হচ্ছে, কোনো কারণবশত কোনো ব্যক্তি ঐ দিনের আসরের নামাজ না পড়ে থাকলে, সূর্য পুরোপুরি ডুবে যাওয়ার আগে অর্থাৎ যখন সূর্য ডুবা শুরু করেছে বা ডুবছে এমন অবস্থাতেও ঐ দিনের আসরের নামাজ পড়তে পারবে। ঐ দিনের আসরের নামাজ সূর্য ডোবার নিষিদ্ধ সময়ে পড়লে তা হারাম হিসাবে গণ্য হবে না। কিন্তু ঐদিনের আসরের নামাজ ব্যতীত অন্য কোনো নফল বা কাজা নামাজ সূর্য ডোবার সময় পড়া যাবে না। তবে এরকম দেরী করে নামাজ পড়া খুবই অনুচিত কাজ। আমাদের উচিত ওয়াক্ত শুরুর সাথে সাথেই নামাজ আদায় করা।",
    "body_bn": "আসরের ওয়াক্ত শুরু হয় যুহরের ওয়াক্ত শেষ হওয়ার সাথে সাথে। আর ওয়াক্ত শেষ হয় সূর্য ডুবতে শুরু করলে। এটা নিয়ে ইমামদের মাঝে মতপার্থক্য নাই।\n\nকিন্তু মতপার্থক্য আছে যুহরের শেষ সময় কখন তা নিয়ে। যে ব্যাপারে যুহরের ওয়াক্ত নির্ধারণ পদ্ধতিতে বিস্তারিত বলা হয়েছে। তাই আর এখানে সেই আলোচনার পুনরাবৃত্তি করলাম না।\n\nসেটিংস থেকে মাজহাব সেট করে নিলে ঐ মাজহাবের ফতোয়ার সময় অনুযায়ী আসরের শুরুর ওয়াক্ত সেট হবে। আর আসরের ওয়াক্ত শেষ হওয়ার সময় বের করা হয়েছে সূর্যাস্তের সময় থেকে ১ মিনিট বিয়োগ করে।\n\nপ্রসঙ্গত উল্লেখ্য, সূর্য যখন ডুবতে থাকে ঐ সময়ে নামাজ পড়া হারাম। কিন্তু অ্যাপে সূর্য ডোবার নিষিদ্ধ সময়টাকেও আসরের সময় হিসাবে দেখানো হয়েছে। এক্ষেত্রে মাসআলা হচ্ছে, কোনো কারণবশত কোনো ব্যক্তি ঐ দিনের আসরের নামাজ না পড়ে থাকলে, সূর্য পুরোপুরি ডুবে যাওয়ার আগে অর্থাৎ যখন সূর্য ডুবা শুরু করেছে বা ডুবছে এমন অবস্থাতেও ঐ দিনের আসরের নামাজ পড়তে পারবে। ঐ দিনের আসরের নামাজ সূর্য ডোবার নিষিদ্ধ সময়ে পড়লে তা হারাম হিসাবে গণ্য হবে না। কিন্তু ঐদিনের আসরের নামাজ ব্যতীত অন্য কোনো নফল বা কাজা নামাজ সূর্য ডোবার সময় পড়া যাবে না। তবে এরকম দেরী করে নামাজ পড়া খুবই অনুচিত কাজ। আমাদের উচিত ওয়াক্ত শুরুর সাথে সাথেই নামাজ আদায় করা।"
  },
  {
    "title_en": "মাগরিবের ওয়াক্ত নির্ধারণ পদ্ধতি",
    "title_bn": "মাগরিবের ওয়াক্ত নির্ধারণ পদ্ধতি",
    "subtitle_en": "মাগরিবের ওয়াক্ত হচ্ছে সূর্যাস্ত থেকে ইশার আগ পর্যন্ত",
    "subtitle_bn": "মাগরিবের ওয়াক্ত হচ্ছে সূর্যাস্ত থেকে ইশার আগ পর্যন্ত",
    "body_en": "সূর্য যখন পুরোপুরি অস্তমিত হয় তখন থেকে মাগরিবের ওয়াক্ত শুরু হয়। শেষ সময় নিয়ে দুইটি মত পাওয়া যায়। ইমাম আবু হানীফার (রহ.) মতে সূর্য ডোবার পর আকাশে লালিমা দেখা যায়। এরপর আকাশে সাদা আলো দেখা যায়। এই সাদা আলো অদৃশ্য হওয়ার আগ পর্যন্ত মাগরিবের ওয়াক্ত থাকে। আর ইমাম শাফেয়ী (রহ.) এবং সাহেবাইনের মতে (ইমাম ইউসুফ ও মুহাম্মদ) লালিমা অদৃশ্য হলেই মাগরিবের ওয়াক্ত শেষ হয়।\n\nএই লালিমা ও সাদা আভা এগুলোর সময় যেহেতু অল্প, তাই মাগরিবের নামাজের শেষ ওয়াক্ত বিষয়ে মাজহাবগত কোনো পার্থক্য রাখা হয় নাই। অন্যান্য আন্তর্জাতিক ওয়েবসাইট ও অ্যাপের মত করে (যেমন islamicfinder.org) আমরাও মাগরিবের শেষ সময় অভিন্ন রেখেছি।\n\nপ্রসঙ্গত উল্লেখ্য, সমাজে মুখে মুখে প্রচলিত যে \"মাগরিবের ওয়াক্ত খুব কম সময় থাকে। ১৫-২০ মিনিটের বেশি না\"। কথাটি সঠিক নয়। নিচের দুটি লিংক থেকে এ ব্যাপারে আলেমদের বক্তব্য দেখে নিতে পারেন।",
    "body_bn": "সূর্য যখন পুরোপুরি অস্তমিত হয় তখন থেকে মাগরিবের ওয়াক্ত শুরু হয়। শেষ সময় নিয়ে দুইটি মত পাওয়া যায়। ইমাম আবু হানীফার (রহ.) মতে সূর্য ডোবার পর আকাশে লালিমা দেখা যায়। এরপর আকাশে সাদা আলো দেখা যায়। এই সাদা আলো অদৃশ্য হওয়ার আগ পর্যন্ত মাগরিবের ওয়াক্ত থাকে। আর ইমাম শাফেয়ী (রহ.) এবং সাহেবাইনের মতে (ইমাম ইউসুফ ও মুহাম্মদ) লালিমা অদৃশ্য হলেই মাগরিবের ওয়াক্ত শেষ হয়।\n\nএই লালিমা ও সাদা আভা এগুলোর সময় যেহেতু অল্প, তাই মাগরিবের নামাজের শেষ ওয়াক্ত বিষয়ে মাজহাবগত কোনো পার্থক্য রাখা হয় নাই। অন্যান্য আন্তর্জাতিক ওয়েবসাইট ও অ্যাপের মত করে (যেমন islamicfinder.org) আমরাও মাগরিবের শেষ সময় অভিন্ন রেখেছি।\n\nপ্রসঙ্গত উল্লেখ্য, সমাজে মুখে মুখে প্রচলিত যে \"মাগরিবের ওয়াক্ত খুব কম সময় থাকে। ১৫-২০ মিনিটের বেশি না\"। কথাটি সঠিক নয়। নিচের দুটি লিংক থেকে এ ব্যাপারে আলেমদের বক্তব্য দেখে নিতে পারেন।",
    "reference_urls": [
      {
        "text": "মাগরিবের ওয়াক্ত কত সময় থাকে? - মাওলানা মামুনুল হক",
        "url": "https://youtu.be/pKu7QI_6PDU"
      },
      {
        "text": "মাগরিবের ওয়াক্ত কত সময় থাকে? - মাওলানা আবুল কালাম আজাদ বাশার",
        "url": "https://youtu.be/uW9C5EEcVgs"
      }
    ]
  },
  {
    "title_en": "মাগরিবের ওয়াক্ত এত বেশি সময় দেখানো হচ্ছে কেন?",
    "title_bn": "মাগরিবের ওয়াক্ত এত বেশি সময় দেখানো হচ্ছে কেন?",
    "subtitle_en": "মাগরিবের ওয়াক্ত শেষ হওয়ার সাথে সাথে ইশার ওয়াক্ত শুরু হয়",
    "subtitle_bn": "মাগরিবের ওয়াক্ত শেষ হওয়ার সাথে সাথে ইশার ওয়াক্ত শুরু হয়",
    "body_en": "অনেকেই মনে করেন মাগরিবের ওয়াক্ত খুব কম সময় থাকে। তারা মনে করেন মাগরিবের ওয়াক্ত ১৫-২০ এর বেশি থাকে না। তাই কোনো কারণে মাগরিবের সালাত আদায় করতে ১৫-২০ মিনিট দেরি হয়ে গেলে তখন আর সালাত আদায় করেন না। মনে করেন “সালাত যেহেতু কাজা হয়েই গেছে তাহলে পরে ইশার সাথেই পড়ে নিব”।\n\nএই ধারণাটি সঠিক নয়।\n\nমাগরিবের ওয়াক্ত ঋতু ভেদে ১ ঘন্টা ১৫ মিনিট থেকে দেড় ঘন্টার মত থাকতে পারে। কিন্তু এরকম দেরি করে পড়া মাকরুহ। তাই ওয়াক্ত হওয়ার পরপরই মাগরিবের সালাত আদায় করা উচিত। আমাদের অ্যাপে মাগরিবের পুরো সময়টিই দেখানে হয়েছে। এটি সঠিক এবং আলেম-ওলামাদের দ্বারা ভেরিফাইড। যেন ইউজারদের কারো কোনো দিন মাগরিবের সালাত পড়তে দেরি হলেও সময় থাকা অবস্থায় যেন পড়ে নিতে পারেন। সময় থাকা অবস্থায় যেন কারোর সালাত কাজা না হয় শুধুমাত্র অজ্ঞতার কারণে।\n\nউক্ত বিষয়ে আপনার কোনো সন্দেহ-সংশয় থেকে থাকলে আপনার পরিচিত আলেম বা মসজিদের ইমাম সাহেবের সাথে কথা বলতে পারেন। ইনশাআল্লাহ তাহলে আপনার সংশয় দূর হবে।",
    "body_bn": "অনেকেই মনে করেন মাগরিবের ওয়াক্ত খুব কম সময় থাকে। তারা মনে করেন মাগরিবের ওয়াক্ত ১৫-২০ এর বেশি থাকে না। তাই কোনো কারণে মাগরিবের সালাত আদায় করতে ১৫-২০ মিনিট দেরি হয়ে গেলে তখন আর সালাত আদায় করেন না। মনে করেন “সালাত যেহেতু কাজা হয়েই গেছে তাহলে পরে ইশার সাথেই পড়ে নিব”।\n\nএই ধারণাটি সঠিক নয়।\n\nমাগরিবের ওয়াক্ত ঋতু ভেদে ১ ঘন্টা ১৫ মিনিট থেকে দেড় ঘন্টার মত থাকতে পারে। কিন্তু এরকম দেরি করে পড়া মাকরুহ। তাই ওয়াক্ত হওয়ার পরপরই মাগরিবের সালাত আদায় করা উচিত। আমাদের অ্যাপে মাগরিবের পুরো সময়টিই দেখানে হয়েছে। এটি সঠিক এবং আলেম-ওলামাদের দ্বারা ভেরিফাইড। যেন ইউজারদের কারো কোনো দিন মাগরিবের সালাত পড়তে দেরি হলেও সময় থাকা অবস্থায় যেন পড়ে নিতে পারেন। সময় থাকা অবস্থায় যেন কারোর সালাত কাজা না হয় শুধুমাত্র অজ্ঞতার কারণে।\n\nউক্ত বিষয়ে আপনার কোনো সন্দেহ-সংশয় থেকে থাকলে আপনার পরিচিত আলেম বা মসজিদের ইমাম সাহেবের সাথে কথা বলতে পারেন। ইনশাআল্লাহ তাহলে আপনার সংশয় দূর হবে।",
    "reference_urls": [
      {
        "text": "মাগরিবের ওয়াক্ত কত সময় থাকে? - মাওলানা মামুনুল হক",
        "url": "https://youtu.be/pKu7QI_6PDU"
      },
      {
        "text": "মাগরিবের ওয়াক্ত কত সময় থাকে? - মাওলানা আবুল কালাম আজাদ বাশার",
        "url": "https://youtu.be/uW9C5EEcVgs"
      }
    ]
  },
  {
    "title_en": "ইশার ওয়াক্ত নির্ধারণ পদ্ধতি",
    "title_bn": "ইশার ওয়াক্ত নির্ধারণ পদ্ধতি",
    "subtitle_en": "ইশার ওয়াক্ত হচ্ছে মাগরিবের ওয়াক্ত শেষ হওয়া থেকে ফজরের আগ পর্যন্ত",
    "subtitle_bn": "ইশার ওয়াক্ত হচ্ছে মাগরিবের ওয়াক্ত শেষ হওয়া থেকে ফজরের আগ পর্যন্ত",
    "body_en": "মাগরিবের ওয়াক্ত শেষ হওয়ার সাথে সাথে ইশার ওয়াক্ত শুরু হয়। হানাফী মাজহাবের ফতোয়া অনুযায়ী, ইশার ওয়াক্ত শেষ হয় ফজরের ওয়াক্ত অর্থাৎ সুবহে সাদিক শুরুর আগ পর্যন্ত। তবে মধ্য রাত পার হবার পর ইশার নামাজ পড়া মাকরুহ কিন্তু জায়েজ। অর্থাৎ মধ্য রাতের পর ইশা পড়লে তা \"আদা\" হিসাবে গণ্য হবে, \"কাজা\" হবে না। তবে মধ্য রাতের পর ইশা পড়া মাকরুহ বা মন্দ কাজ।\n\nহানাফী মাজহাব ব্যতীত অন্যান্য মাজহাবের মতে ইশার ওয়াক্ত শেষ হয় মধ্যরাতে। অর্থাৎ মধ্যরাতের পর ইশার সালাত আদায় করলে তা কাজা হিসাবে গণ্য হবে।\n\nআমাদের অ্যাপের সেটিংস থেকে আপনি হানাফী মাজহাব সিলেক্ট করলে ইশার শেষ ওয়াক্ত দেখতে পাবেন ফজরের আগ পর্যন্ত। আর অন্য মাজহাব সিলেক্ট করা থাকলে ইশার শেষ ওয়াক্ত দেখাবে মধ্যরাত পর্যন্ত।",
    "body_bn": "মাগরিবের ওয়াক্ত শেষ হওয়ার সাথে সাথে ইশার ওয়াক্ত শুরু হয়। হানাফী মাজহাবের ফতোয়া অনুযায়ী, ইশার ওয়াক্ত শেষ হয় ফজরের ওয়াক্ত অর্থাৎ সুবহে সাদিক শুরুর আগ পর্যন্ত। তবে মধ্য রাত পার হবার পর ইশার নামাজ পড়া মাকরুহ কিন্তু জায়েজ। অর্থাৎ মধ্য রাতের পর ইশা পড়লে তা \"আদা\" হিসাবে গণ্য হবে, \"কাজা\" হবে না। তবে মধ্য রাতের পর ইশা পড়া মাকরুহ বা মন্দ কাজ।\n\nহানাফী মাজহাব ব্যতীত অন্যান্য মাজহাবের মতে ইশার ওয়াক্ত শেষ হয় মধ্যরাতে। অর্থাৎ মধ্যরাতের পর ইশার সালাত আদায় করলে তা কাজা হিসাবে গণ্য হবে।\n\nআমাদের অ্যাপের সেটিংস থেকে আপনি হানাফী মাজহাব সিলেক্ট করলে ইশার শেষ ওয়াক্ত দেখতে পাবেন ফজরের আগ পর্যন্ত। আর অন্য মাজহাব সিলেক্ট করা থাকলে ইশার শেষ ওয়াক্ত দেখাবে মধ্যরাত পর্যন্ত।"
  },
  {
    "title_en": "সালাতুদ দুহা, ইশরাক, চাশত, আওয়াবিন ও তাহাজ্জুদ সালাত বিষয়ে জ্ঞাতব্য",
    "title_bn": "সালাতুদ দুহা, ইশরাক, চাশত, আওয়াবিন ও তাহাজ্জুদ সালাত বিষয়ে জ্ঞাতব্য",
    "subtitle_en": "",
    "subtitle_bn": "",
    "body_en": "সালাতুদ দুহাঃ\n(ইশরাক, চাশত, আওয়াবিন)\n-----------------------------------------\nএ সালাতগুলোর সময়সীমা হচ্ছে সূর্য পুরোপুরি উদিত হওয়ার পর থেকে সূর্য মধ্য আকাশে পৌঁছানোর আগ পর্যন্ত। হাদীসের পরিভাষায় একে বলা হয় সালাতুদ দুহা।\n\nসালাতুদ দুহার দুইটি পর্যায় রয়েছে। একটি হচ্ছে ইশরাক অপরটি হচ্ছে চাশত বা আওয়াবিন।\n\nইশরাকঃ ফজরের সালাত জামায়াতের সাথে আদায় করে ঐ স্থানেই বসে অপেক্ষা করা। সূর্য পুরোপুরি উঠে যাওয়ার পর দুই রাকাত সালাত আদায় করা। এতে আল্লাহ একটি পূর্ণ হজ্জ ও একটি পূর্ণ ওমরাহ করার সাওয়াব দান করবেন।\n\nআনাস ইবনু মালিক (রাঃ) থেকে বর্ণিতঃ তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম বলেছেন, \n\nযে ব্যক্তি ফজরের নামায জামা’আতে আদায় করে, তারপর সূর্য উঠা পর্যন্ত বসে বসে আল্লাহ তা’আলার যিকর করে, তারপর দুই রাক’আত নামায আদায় করে- তার জন্য একটি হাজ্জ ও একটি উমরার সাওয়াব রয়েছে। আনাস (রাঃ) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম বলেছেনঃ পূর্ণ, পূর্ণ, পূর্ণ (হাজ্জ ও উমরার সাওয়াব)।\n(তিরমিযি ৫৮৬, http://ihadis.com/books/tirmidi/hadis/586)\n\nচাশত বা আওয়াবিনঃ সূর্য যখন একটু তেতে উঠে। রোদের তেজ বাড়তে থাকে। তখন থেকে শুরু করে দ্বিপ্রহরের নিষিদ্ধ সময়ের আগ পর্যন্ত যেই সালাতুদ দুহা পড়া হয় তাকে চাশত বা আওয়াবিন বলা হয়। এ সালাতের রাকাত সংখ্যা নির্দিষ্ট নয়। ২ থেকে ১২ রাকাত বা আরো বেশি পড়া যেতে পারে।\n\nক্বাসিম আশ্ শায়বানী (রহঃ) থেকে বর্ণিতঃ\nযায়দ ইবনু আর্‌ক্বাম (রাঃ) একদল লোককে ‘যুহা’ বা চাশ্‌তের সলাত আদায় করতে দেখে বললেনঃ এখন তো লোকজন জেনে নিয়েছে যে , এ সময় ব্যতীত অন্য সময় সলাত আদায় করা উত্তম বা সর্বাধিক মর্যাদার। কেননা রসূলুল্লাহ্ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ ‘সলাতুল আওয়াবীন’ বা আল্লাহকে অধিক স্মরনকারী বান্দাদের সলাতের সময় হল তখন, যখন সূর্যতাপে উটের বাচ্চাদের পা গরম হয়ে যায়।\n(মুসলিম ১৬৩১, http://ihadis.com/books/muslim/hadis/1631)\n\nতবে আলেমদের বর্ণনা থেকে জেনেছি মাগরিবের সালাতের পর যে নফল সালাত রয়েছে সেটাও হাদীসের ভাষায় আওয়াবিন সালাত বলে উল্লেখ করা হয়েছে। কিন্তু সে হাদীসগুলোর বর্ণনাসূত্র যইফ বা দুর্বল। কিন্তু মাগরিবের পর যে নফল সালাত নবীজি (সা) পড়তেন এ ব্যাপারে সহীহ হাদীস রয়েছে।\n\nমাগরিবের পর নফল সালাত (আওয়াবিন)\n-----------------------------------------\nনবীজি (সা) মাগরিবের পর থেকে ইশার ওয়াক্ত হওয়ার আগ পর্যন্ত নফল সালাত আদায় করতেন। এর রাকাত সংখ্যা সুনির্দিষ্ট করে কোনো সহীহ হাদীস থেকে পাওয়া যায় না। আমাদের সাধ্য মত যত ইচ্ছা পড়তে পারি।\n\n৬ ও ২০ রাকাতের ব্যাপারে হাদীসের বর্ণনা পাওয়া যায়। যেগুলোর সনদ দুর্বল বা যইফ।\n\nআবূ হুরাইরা (রাঃ) থেকে বর্ণিতঃ\nতিনি বলেনঃ রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ কোন ব্যক্তির মাগরিবের পর ছয় রাক’আত নামায আদায় করলে এবং তার মাঝখানে কোন অশালীন কথা না বললে তাঁকে এর বিনিময়ে বার বছরের ইবাদাতের সমান সাওয়াব দেয়া হবে।\n(হাদীসের মানঃ যইফ জিদ্দান বা খুবই দুর্বল, তিরমিযি ৪৩৫, http://ihadis.com/books/tirmidi/hadis/435)\n\nআমাদের দেশের অনেক বইপুস্তকে এ সালাতের প্রতি রাকাতে কোন কোন সূরা পড়তে হবে এমন কিছু বিশেষ নিয়মের উল্লেখ পাওয়া যায়। এগুলোর গ্রহনযোগ্য কোনো ভিত্তি নাই। যে কোনো সূরা দিয়ে অন্যান্য নফল সালাতের মত করে ২ রাকাত করে যত বেশি ইচ্ছা পড়ব।\n\nরাসূলুল্লাহ (সা) নিজে ও তাঁর সাহাবীগণ মাগরিব ও ইশার মধ্যবর্তী সময়ে বেশি বেশি নফল সালাত আদায় করতেন বলে সহীহ হাদীসে বর্ণিত হয়েছে। হুযাইফা (রা) বলেন, “আমি নবীজী (সা)-র কাছে এসে তাঁর সাথে মাগরিবের সালাত আদায় করলাম। তিনি মাগরিবের পরে ইশা’র সালাত পর্যন্ত নফল সালাতে রত থাকলেন।”\n(ইবন আবী শাইবা, মুসান্নাফ ২/১৫; নাসাঈ, আস-সুনানুল কুবরা ১/৫১, ৫/৮০; আলবানী, সহীহুত তারগীব ১/৩১৩)\n\nআনাস (রা) বলেন, ‘‘সাহাবায়ে কেরাম মাগরিব ও ইশা’র মধ্যবর্তী সময়ে সজাগ থেকে অপেক্ষা করতেন এবং নফল সালাত আদায় করতেন।’’ (বাইহাকী, আস-সুনানুল কুবরা ৩/১৯; আবূ দাউদ, সুনান ২/৩৫, হাইসামী, মাজমাউয যাওয়াইদ ২/২৩০, ইবনু আবী শাইবা, মুসান্নাফ ২/১৫, আলবানী, সহীহুত তারগীব ১/৩১৩)\nতাবিয়ী হাসান বসরী (রহ) বলতেন, মাগরিব ও ইশা’র মধ্যবর্তী সময়ের নামাযও রাতের নামায বা তাহাজ্জুদ বলে গণ্য হবে।\n\nতাহাজ্জুদ\n-------------------------\n\nতাহাজ্জুদের উত্তম সময় হচ্ছে রাতের শেষ তৃতীয়াংশে। সূর্যাস্তের পর থেকে ফজর শুরু হওয়ার মধ্যকার সময়কে ৩ ভাগ করতে হবে। এর শেষ ভাগে ঘুম থেকে উঠে তাহাজ্জুদ আদায় করা উত্তম। আমরা সিয়াম পালনের সময় যখন সাহরি খেতে উঠি, তখন তাহাজ্জুদ আদায় করার একটা সুবর্ণ সুযোগ।\n\nআবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ আল্লাহ্‌র রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ \nমহামহিম আল্লাহ্‌ তা’আলা প্রতি রাতের শেষ তৃতীয়াংশ অবশিষ্ট থাকাকালে পৃথিবীর নিকটবর্তী আসমানে অবতরণ করে ঘোষণা করতে থাকেনঃ কে আছে এমন, যে আমাকে ডাকবে? আমি তার ডাকে সাড়া দিব। কে আছে এমন যে, আমার নিকট চাইবে। আমি তাকে তা দিব। কে আছে এমন যে আমার নিকট ক্ষমা চাইবে? আমি তাকে ক্ষমা করব।\n(বুখারি ১১৪৫ http://ihadis.com/books/bukhari/hadis/1145)\n\nকিন্তু কেউ শেষ ভাগে উঠে তাহাজ্জুদ পড়তে পারবে কিনা সন্দীহান হলে সে ঘুমানোর আগেই পড়ে নিবে। এতেও তাহাজ্জুদের সওয়াব পাওয়া যাবে ইনশাআল্লাহ। এ সালাতের রাকাত সংখ্যা নির্দিষ্ট নয়। এর জন্য ভিন্ন কোনো নিয়ম বা নির্দিষ্ট কোনো সূরা নাই। আমাদের উচিত তাহাজ্জুদের সালাতে সাধ্য মত দীর্ঘ কুরআন তিলাওয়াত করা। বড় সূরা মুখস্থ না থাকলে যেগুলো মুখস্থ আছে সেগুলো পড়া। যেমনঃ ছোট ১০টা সূরা মুখস্থ থাকলে ২ রাকাতে ৫টি করে সূরা তিলাওয়াত করতে পারি। দীর্ঘ সময় ধরে রুকু সিজদা করা উচিত। রুকু সিজদায় বিভিন্ন দুআ করা উচিত।\n\nআমাদের উক্ত বর্ণনায় কোনো ভুল পরিলক্ষিত হলে অনুগ্রহ করে আমাদেরকে ইমেইল বা ফেসবুকের মাধ্যমে অবহিত করুন। আমরা ইনশাআল্লাহ সংশোধন করে নিব।",
    "body_bn": "সালাতুদ দুহাঃ\n(ইশরাক, চাশত, আওয়াবিন)\n-----------------------------------------\nএ সালাতগুলোর সময়সীমা হচ্ছে সূর্য পুরোপুরি উদিত হওয়ার পর থেকে সূর্য মধ্য আকাশে পৌঁছানোর আগ পর্যন্ত। হাদীসের পরিভাষায় একে বলা হয় সালাতুদ দুহা।\n\nসালাতুদ দুহার দুইটি পর্যায় রয়েছে। একটি হচ্ছে ইশরাক অপরটি হচ্ছে চাশত বা আওয়াবিন।\n\nইশরাকঃ ফজরের সালাত জামায়াতের সাথে আদায় করে ঐ স্থানেই বসে অপেক্ষা করা। সূর্য পুরোপুরি উঠে যাওয়ার পর দুই রাকাত সালাত আদায় করা। এতে আল্লাহ একটি পূর্ণ হজ্জ ও একটি পূর্ণ ওমরাহ করার সাওয়াব দান করবেন।\n\nআনাস ইবনু মালিক (রাঃ) থেকে বর্ণিতঃ তিনি বলেনঃ রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম বলেছেন, \n\nযে ব্যক্তি ফজরের নামায জামা’আতে আদায় করে, তারপর সূর্য উঠা পর্যন্ত বসে বসে আল্লাহ তা’আলার যিকর করে, তারপর দুই রাক’আত নামায আদায় করে- তার জন্য একটি হাজ্জ ও একটি উমরার সাওয়াব রয়েছে। আনাস (রাঃ) বলেন, রাসূলুল্লাহ সাল্লাল্লাহু ‘আলাইহি ওয়াসাল্লাম বলেছেনঃ পূর্ণ, পূর্ণ, পূর্ণ (হাজ্জ ও উমরার সাওয়াব)।\n(তিরমিযি ৫৮৬, http://ihadis.com/books/tirmidi/hadis/586)\n\nচাশত বা আওয়াবিনঃ সূর্য যখন একটু তেতে উঠে। রোদের তেজ বাড়তে থাকে। তখন থেকে শুরু করে দ্বিপ্রহরের নিষিদ্ধ সময়ের আগ পর্যন্ত যেই সালাতুদ দুহা পড়া হয় তাকে চাশত বা আওয়াবিন বলা হয়। এ সালাতের রাকাত সংখ্যা নির্দিষ্ট নয়। ২ থেকে ১২ রাকাত বা আরো বেশি পড়া যেতে পারে।\n\nক্বাসিম আশ্ শায়বানী (রহঃ) থেকে বর্ণিতঃ\nযায়দ ইবনু আর্‌ক্বাম (রাঃ) একদল লোককে ‘যুহা’ বা চাশ্‌তের সলাত আদায় করতে দেখে বললেনঃ এখন তো লোকজন জেনে নিয়েছে যে , এ সময় ব্যতীত অন্য সময় সলাত আদায় করা উত্তম বা সর্বাধিক মর্যাদার। কেননা রসূলুল্লাহ্ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ ‘সলাতুল আওয়াবীন’ বা আল্লাহকে অধিক স্মরনকারী বান্দাদের সলাতের সময় হল তখন, যখন সূর্যতাপে উটের বাচ্চাদের পা গরম হয়ে যায়।\n(মুসলিম ১৬৩১, http://ihadis.com/books/muslim/hadis/1631)\n\nতবে আলেমদের বর্ণনা থেকে জেনেছি মাগরিবের সালাতের পর যে নফল সালাত রয়েছে সেটাও হাদীসের ভাষায় আওয়াবিন সালাত বলে উল্লেখ করা হয়েছে। কিন্তু সে হাদীসগুলোর বর্ণনাসূত্র যইফ বা দুর্বল। কিন্তু মাগরিবের পর যে নফল সালাত নবীজি (সা) পড়তেন এ ব্যাপারে সহীহ হাদীস রয়েছে।\n\nমাগরিবের পর নফল সালাত (আওয়াবিন)\n-----------------------------------------\nনবীজি (সা) মাগরিবের পর থেকে ইশার ওয়াক্ত হওয়ার আগ পর্যন্ত নফল সালাত আদায় করতেন। এর রাকাত সংখ্যা সুনির্দিষ্ট করে কোনো সহীহ হাদীস থেকে পাওয়া যায় না। আমাদের সাধ্য মত যত ইচ্ছা পড়তে পারি।\n\n৬ ও ২০ রাকাতের ব্যাপারে হাদীসের বর্ণনা পাওয়া যায়। যেগুলোর সনদ দুর্বল বা যইফ।\n\nআবূ হুরাইরা (রাঃ) থেকে বর্ণিতঃ\nতিনি বলেনঃ রাসূলুল্লাহ (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ কোন ব্যক্তির মাগরিবের পর ছয় রাক’আত নামায আদায় করলে এবং তার মাঝখানে কোন অশালীন কথা না বললে তাঁকে এর বিনিময়ে বার বছরের ইবাদাতের সমান সাওয়াব দেয়া হবে।\n(হাদীসের মানঃ যইফ জিদ্দান বা খুবই দুর্বল, তিরমিযি ৪৩৫, http://ihadis.com/books/tirmidi/hadis/435)\n\nআমাদের দেশের অনেক বইপুস্তকে এ সালাতের প্রতি রাকাতে কোন কোন সূরা পড়তে হবে এমন কিছু বিশেষ নিয়মের উল্লেখ পাওয়া যায়। এগুলোর গ্রহনযোগ্য কোনো ভিত্তি নাই। যে কোনো সূরা দিয়ে অন্যান্য নফল সালাতের মত করে ২ রাকাত করে যত বেশি ইচ্ছা পড়ব।\n\nরাসূলুল্লাহ (সা) নিজে ও তাঁর সাহাবীগণ মাগরিব ও ইশার মধ্যবর্তী সময়ে বেশি বেশি নফল সালাত আদায় করতেন বলে সহীহ হাদীসে বর্ণিত হয়েছে। হুযাইফা (রা) বলেন, “আমি নবীজী (সা)-র কাছে এসে তাঁর সাথে মাগরিবের সালাত আদায় করলাম। তিনি মাগরিবের পরে ইশা’র সালাত পর্যন্ত নফল সালাতে রত থাকলেন।”\n(ইবন আবী শাইবা, মুসান্নাফ ২/১৫; নাসাঈ, আস-সুনানুল কুবরা ১/৫১, ৫/৮০; আলবানী, সহীহুত তারগীব ১/৩১৩)\n\nআনাস (রা) বলেন, ‘‘সাহাবায়ে কেরাম মাগরিব ও ইশা’র মধ্যবর্তী সময়ে সজাগ থেকে অপেক্ষা করতেন এবং নফল সালাত আদায় করতেন।’’ (বাইহাকী, আস-সুনানুল কুবরা ৩/১৯; আবূ দাউদ, সুনান ২/৩৫, হাইসামী, মাজমাউয যাওয়াইদ ২/২৩০, ইবনু আবী শাইবা, মুসান্নাফ ২/১৫, আলবানী, সহীহুত তারগীব ১/৩১৩)\nতাবিয়ী হাসান বসরী (রহ) বলতেন, মাগরিব ও ইশা’র মধ্যবর্তী সময়ের নামাযও রাতের নামায বা তাহাজ্জুদ বলে গণ্য হবে।\n\nতাহাজ্জুদ\n-------------------------\n\nতাহাজ্জুদের উত্তম সময় হচ্ছে রাতের শেষ তৃতীয়াংশে। সূর্যাস্তের পর থেকে ফজর শুরু হওয়ার মধ্যকার সময়কে ৩ ভাগ করতে হবে। এর শেষ ভাগে ঘুম থেকে উঠে তাহাজ্জুদ আদায় করা উত্তম। আমরা সিয়াম পালনের সময় যখন সাহরি খেতে উঠি, তখন তাহাজ্জুদ আদায় করার একটা সুবর্ণ সুযোগ।\n\nআবূ হুরায়রা (রাঃ) থেকে বর্ণিতঃ আল্লাহ্‌র রাসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ \nমহামহিম আল্লাহ্‌ তা’আলা প্রতি রাতের শেষ তৃতীয়াংশ অবশিষ্ট থাকাকালে পৃথিবীর নিকটবর্তী আসমানে অবতরণ করে ঘোষণা করতে থাকেনঃ কে আছে এমন, যে আমাকে ডাকবে? আমি তার ডাকে সাড়া দিব। কে আছে এমন যে, আমার নিকট চাইবে। আমি তাকে তা দিব। কে আছে এমন যে আমার নিকট ক্ষমা চাইবে? আমি তাকে ক্ষমা করব।\n(বুখারি ১১৪৫ http://ihadis.com/books/bukhari/hadis/1145)\n\nকিন্তু কেউ শেষ ভাগে উঠে তাহাজ্জুদ পড়তে পারবে কিনা সন্দীহান হলে সে ঘুমানোর আগেই পড়ে নিবে। এতেও তাহাজ্জুদের সওয়াব পাওয়া যাবে ইনশাআল্লাহ। এ সালাতের রাকাত সংখ্যা নির্দিষ্ট নয়। এর জন্য ভিন্ন কোনো নিয়ম বা নির্দিষ্ট কোনো সূরা নাই। আমাদের উচিত তাহাজ্জুদের সালাতে সাধ্য মত দীর্ঘ কুরআন তিলাওয়াত করা। বড় সূরা মুখস্থ না থাকলে যেগুলো মুখস্থ আছে সেগুলো পড়া। যেমনঃ ছোট ১০টা সূরা মুখস্থ থাকলে ২ রাকাতে ৫টি করে সূরা তিলাওয়াত করতে পারি। দীর্ঘ সময় ধরে রুকু সিজদা করা উচিত। রুকু সিজদায় বিভিন্ন দুআ করা উচিত।\n\nআমাদের উক্ত বর্ণনায় কোনো ভুল পরিলক্ষিত হলে অনুগ্রহ করে আমাদেরকে ইমেইল বা ফেসবুকের মাধ্যমে অবহিত করুন। আমরা ইনশাআল্লাহ সংশোধন করে নিব।",
    "reference_urls": [
      {
        "text": "আল্লাহর মাহবুব বান্দা বনার আমল",
        "url": "https://www.alkawsar.com/bn/article/936"
      },
      {
        "text": "দ্বিতীয় সর্বোচ্চ গুরুত্বপূর্ণ নফল নামাজ-যা হাজারে ১জনও পড়েন না!",
        "url": "https://youtu.be/UMJ16dK-bjs"
      },
      {
        "text": "মাগরিবের পর নফল সালাত পড়া যাবে কিনা?",
        "url": "https://youtu.be/Bb6j87qYmAM"
      },
      {
        "text": "ইশরাক্ব ও চাশতের নামাজের ফযিলত কি? এবং কখন ও কিভাবে পরতে হয়?",
        "url": "https://youtu.be/oLewtFGC0nk"
      },
      {
        "text": "আওয়াবীন নামাজ কী? কখন পড়তে হয়?",
        "url": "https://youtu.be/n6TI_BRLMo4"
      },
      {
        "text": "ইশরাক ও চাশতের নামায কাকে বলে কখন পড়তে হয়",
        "url": "https://youtu.be/pK2mpgw8HF0"
      }
    ]
  }
]